uhnp/src/Documents/УстановкаНациональногоРежима/УстановкаНациональногоРежима.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>УстановкаНациональногоРежима</name>
  <registerRecords>InformationRegister.ПараметрыПреференцийОКПД2</registerRecords>
  <attributes>
    <name>ДатаНачалаДействия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Приказ</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ПараметрыПреференцийОКПД2</name>
    <attributes>
      <name>ОКПД2</name>
      <type>
        <types>CatalogRef.КлассификаторОКПД2</types>
      </type>
    </attributes>
    <attributes>
      <name>НациональныйРежимЗакупок</name>
      <type>
        <types>EnumRef.НациональныйРежимЗакупок</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

uhnp/src/InformationRegisters/ПараметрыПреференцийОКПД2/ПараметрыПреференцийОКПД2.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПараметрыПреференцийОКПД2</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Значение</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЗапретОграничение</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>НациональныйРежимЗакупок</name>
    <type>
      <types>EnumRef.НациональныйРежимЗакупок</types>
    </type>
  </resources>
  <dimensions>
    <name>ОКПД2</name>
    <type>
      <types>CatalogRef.КлассификаторОКПД2</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

uhnp/src/Documents/УстановкаНациональногоРежима/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
	Движения.ПараметрыПреференцийОКПД2.Записывать = Истина;
	Для Каждого ТекСтрокаПараметрыПреференцийОКПД2 Из ПараметрыПреференцийОКПД2 Цикл
		Движение = Движения.ПараметрыПреференцийОКПД2.Добавить();
		Движение.Период = ЭтотОбъект.ДатаНачалаДействия;
		Движение.ОКПД2 = ТекСтрокаПараметрыПреференцийОКПД2.ОКПД2;
		Движение.Значение = ТекСтрокаПараметрыПреференцийОКПД2.Значение;
		Движение.НациональныйРежимЗакупок = ТекСтрокаПараметрыПреференцийОКПД2.НациональныйРежимЗакупок;
	КонецЦикла;
КонецПроцедуры
